byAlex_regularPorousMedia-master/twoPhase/incompressible/lattice/src/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    empty_1
    {
        type            empty;
    }

    empty_2
    {
        type            empty;
    }

    left
    {
        type            noSlip;
//         type            zeroGradient;
    }

    right
    {
        type            noSlip;
//         type            zeroGradient;
    }

    top
    {
        type            noSlip;
//         type            zeroGradient;
    }

    bottom
    {
        type            noSlip;
//         type            zeroGradient;
    }

    latticeWalls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
