byAlex_regularPorousMedia-master/twoPhase/incompressible/lattice/src/constant/src/transportProperties.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( phase1 phase2 );

phase1
{
    transportModel  Newtonian;
    nu              1e-05;
    rho             900;
}

phase2
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

sigma           0.046;

// ************************************************************************* //
