byAlex_regularPorousMedia-master/twoPhase/incompressible/lattice/src/system/snappyHexMeshSrc/STL_list
lattice.stl
{
    type triSurfaceMesh;
    name lattice;
}
latticeWalls.stl
{
    type triSurfaceMesh;
    name latticeWalls;
}
