byAlex_regularPorousMedia-master/twoPhase/incompressible/lattice/src/system/snappyHexMeshSrc/refinementSurfaces_list
latticeWalls
{
    level (2 2);
    patchInfo{type wall;}
}
